2023-01/smartsim/mesh-motion/spinningDisk/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dynamicFvMesh dynamicMotionSolverFvMesh;
motionSolverLibs (fvMotionSolvers);
motionSolver displacementSBRStress;    //velocityComponentLaplacian z;
    // diffusivity  uniform;
    // diffusivity  directional (1 200 0);
    // diffusivity  motionDirectional (1 1000 0);
    // diffusivity  file motionDiffusivity;
    diffusivity  quadratic inverseDistance 1(cylinder);

/*
solver            displacementLaplacian;
displacementLaplacianCoeffs
{
    //diffusivity       inverseVolume (HULL); //inverseDistance (HULL);
    //diffusivity       inverseDistance (HULL);
    //diffusivity         bufferZone (HULL);
    diffusivity         inverseFaceDistance 1(cylinder);
}
*/

// ************************************************************************* //
